export const GDGoC_KNU_SCHEDULE = [
  { title: '온라인 세미나', date: '2024-11-06T20:00:00' },
  {
    title: 'Vision Challenge Hackathon',
    start: '2024-11-15T17:00:00',
    end: '2024-11-16T11:30:00',
  },
  { title: '온라인 세미나', date: '2024-11-20T20:00:00' },
  { title: '4분기 커뮤니티 네트워킹', date: '2024-11-23T18:30:00' },
  { title: '오프라인 세미나', date: '2024-11-27T19:00:00' },
  { title: '온라인 세미나', date: '2024-12-04T20:00:00' },
  {
    title: '기말고사',
    start: '2024-12-13',
    end: '2024-12-23T24:00:00',
  },
  { title: '크리스마스(휴일)', date: '2024-12-25' },
  { title: '신년새해(휴일)', date: '2025-01-01' },
  { title: '오프라인 세미나', date: '2025-01-08T19:00:00' },
  { title: '온라인 세미나', date: '2025-01-15T20:00:00' },
  { title: '오프라인 세미나', date: '2025-01-22T19:00:00' },
  { title: '온라인 세미나', date: '2025-01-29T20:00:00' },
];
