export const FrontendData = {
  korean: '프론트엔드 개발자',
  english: 'Frontend Developer',
  explain: `사용자와 서비스가 직접 상호작용하는 부분을 담당합니다. 웹이나
              앱을 시각화하고, 사용자들이 쉽고 빠르게 사용할 수 있도록
              서비스를 구축하고 개선합니다.`,
  duedate: '2024.09.05',
  link: 'form',
  recruit: [
    '개발에 관심있고 열정 있으신 분',
    '프로젝트 경험을 쌓고 싶으신 분',
    '자기 주도적 학습이 가능하신분',
    'Html, CSS, JavaScript를 사용해본 경험이 있으신 분',
    '경북대학교 1학년 ~ 4학년(학과 무관)',
    '중간에 포기하지 않고 끝까지 완주할 수 있는 분',
    '배운 지식을 공유하는 것을 즐기시는 분',
  ],
  prefer: [
    '프론트엔드 개발 경험이 있으신 분',
    'React, Vue.js, Angular 등의 프레임워크를 사용해본 경험이 있으신 분',
    'UI/UX에 대한 이해가 있으신 분',
    'Git을 사용해본 경험이 있으신 분',
    '개발 협업 경험이 있으신 분',
  ],
  event: [
    '격주마다 온라인 세미나 참여할 수 있어요.',
    'GDSC KOR나 GDG on Campus KNU가 기획 및 운영하는 이벤트에 참여할 수 있어요.',
    'GDG on Campus KNU에서 진행하는 프로젝트에 참여할 수 있어요.',
  ],
};

export const BackendData = {
  korean: '백엔드 개발자',
  english: 'Backend Developer',
  explain:
    '웹이나 앱의 보이지 않는 서버를 담당합니다. 사용자가 웹이나 앱과 상호작용할 때 필요한 서버, 데이터베이스, 애플리케이션 로직을 개발하고 유지보수합니다.',
  duedate: '2024.12.27',
  link: 'form',
  recruit: [
    '개발에 관심있고 열정 있으신 분',
    '프로젝트 경험을 쌓고 싶으신 분',
    '자기 주도적 학습이 가능하신분',
    '백엔드에 관련해서 무엇이든 공부해본 경험이 있으신 분',
    '경북대학교 1학년 ~ 4학년(학과 무관)',
  ],
  prefer: [
    '개인시간 충분히 할애할 수 있는 사람',
    'Spring Boot 등의 프레임워크를 사용해본 경험이 있으신 분',
    '팀프로젝트 경험에서 의견 충돌이나 성실히 임하지 않는 경우 등의 갈등 상황 해결 잘할수있는 사람',
    '한달 이상의 프로젝트 경험이 적어도 1개 이상 있는 사람',
  ],
  event: [
    '격주마다 온라인 세미나 참여할 수 있어요.',
    'GDSC KOR나 GDG on Campus KNU가 기획 및 운영하는 이벤트에 참여할 수 있어요.',
    'GDG on Campus KNU에서 진행하는 프로젝트에 참여할 수 있어요.',
  ],
};

export const AIData = {
  korean: '인공지능 개발자',
  english: 'AI Developer',
  explain:
    '인공지능 시스템을 설계하는 엔지니어입니다. 인공지능 기술을 활용하여 업무를 자동화하거나 인사이트를 도출하는 등 각종 문제를 해결합니다.',
  duedate: '2024.12.27',
  link: 'form',
  recruit: [
    '개발에 관심있고 열정 있으신 분',
    '프로젝트 경험을 쌓고 싶으신 분',
    '경북대학교 1학년 ~ 4학년(학과 무관)',
    'pytorch 다룰줄 알고 모델 설계 및 학습 경험 있는 사람',
  ],
  prefer: [
    '개인시간 충분히 할애할 수 있는 사람',
    '직접 모델을 설계하고 학습시켜본 경험이 있으신 분',
    '각종 AI 경진대회 수상 경험이 있으신 분',
    '컴퓨터 Vision 분야 학습 경험 있는 사람',
  ],
  event: [
    '격주마다 온라인 세미나 참여할 수 있어요.',
    'GDSC KOR나 GDG on Campus KNU가 기획 및 운영하는 이벤트에 참여할 수 있어요.',
    'GDG on Campus KNU에서 진행하는 프로젝트에 참여할 수 있어요.',
  ],
};

export const AndroidData = {
  korean: '안드로이드 개발자',
  english: 'Android Developer',
  explain:
    '모바일 애플리케이션 설계, 개발 및 유지보수를 담당합니다. 안드로이드 플랫폼에서의 소프트웨어 개발에 특화되어 사용자 경험을 개선하고 기능을 구현합니다.',
  duedate: '2024.09.05',
  link: 'form',
  recruit: [
    '개발에 관심있고 열정 있으신 분',
    '프로젝트 경험을 쌓고 싶으신 분',
    '자기 주도적 학습이 가능하신분',
    '안드로이드에 관련해서 무엇이든 공부해본 경험이 있으신 분',
    '경북대학교 1학년 ~ 4학년(학과 무관)',
    '중간에 포기하지 않고 끝까지 완주할 수 있는 분',
  ],
  prefer: [
    '안드로이드 개발 경험이 있으신 분',
    'Kotlin을 사용해본 경험이 있으신 분',
    'UI/UX에 대한 이해가 있으신 분',
    'Git을 사용해본 경험이 있으신 분',
    '개발 협업 경험이 있으신 분',
  ],
  event: [
    '격주마다 온라인 세미나 참여할 수 있어요.',
    'GDG KOR나 GDG on Campus KNU가 기획 및 운영하는 이벤트에 참여할 수 있어요.',
    'GDG on Campus KNU에서 진행하는 프로젝트에 참여할 수 있어요.',
  ],
};

export const DesignerData = {
  korean: '디자이너',
  english: 'Designer',
  explain:
    '사용자 조사, 정보 구조 설계, 와이어 프레임 및 프로토타입 제작 등의 작업을 담당합니다. 디자이너는 사용자의 니즈와 목표를 이해하고, 해당 제품 또는 서비스가 사용자에게 제공하는 가치를 극대화하기 위해 최적의 경험을 설계합니다.',
  duedate: '2024.12.27',
  link: 'form',
  recruit: [
    '프로젝트 경험을 쌓고 싶으신 분',
    'Figma, Photoshop, XD 툴을 사용해본 경험이 있으신 분',
    '경북대학교 1학년 ~ 4학년(학과 무관)',
    '중간에 포기하지 않고 끝까지 완주할 수 있는 분',
  ],
  prefer: ['디자인에 관심있고 열정 있으신 분'],
  event: [
    '격주마다 온라인 세미나 참여할 수 있어요.',
    'GDSC KOR나 GDG on Campus KNU가 기획 및 운영하는 이벤트에 참여할 수 있어요.',
    'GDG on Campus KNU에서 진행하는 프로젝트에 참여할 수 있어요.',
  ],
};
