export const FrontendData = {
  korean: '프론트엔드 개발자',
  english: 'Frontend Developer',
  Question1: {
    main: '본인이 생각하기에 좋은 개발자란 무엇인가요?',
  },
  Question2: {
    main: '지원하게 된 동기가 무엇인가요?',
    sub: '본인의 경험을 기반으로 어필할 수 있는 내용에 대해 자유롭게 기재해주세요.',
  },
  Question3: {
    main: '본인이 겪었던 힘들었던 문제 상황을 적어주세요',
    sub: '프로젝트 말고도 본인이 겪었던 문제 상황과 어떻게 해결한 방법에 대해 적어주세요.',
  },
  Question4: {
    main: '본인이 협업해본 경험에 대해 적어주세요.',
    sub: '협업에서 본인이 어떤 부분을 맡았는지, 느낀점과 깨달은 점을 적어주세요. (없으면 안 적어주셔도 상관없습니다.)',
  },
};

export const BackendData = {
  korean: '백엔드 개발자',
  english: 'Backend Developer',
  Question1: {
    main: '본인이 지금까지 공부해왔던 경험과 앞으로의 공부 방향성에 대해 말씀해 주세요.',
  },
  Question2: {
    main: '지원하게 된 동기가 무엇인가요?',
    sub: '본인의 경험을 기반으로 어필할 수 있는 내용에 대해 자유롭게 기재해주세요.',
  },
  Question3: {
    main: '본인이 협업에서 겪었던 힘들었던 문제 상황을 적어주세요',
    sub: '본인이 겪었던 문제 상황과 어떻게 해결한 방법에 대해 적어주세요.',
  },
  Question4: {
    main: '본인이 협업해본 경험에 대해 적어주세요.',
    sub: '협업에서 본인이 어떤 부분을 맡았는지, 느낀점과 깨달은 점을 적어주세요. (없으면 안 적어주셔도 상관없습니다.)',
  },
};

export const AIData = {
  korean: '인공지능 개발자',
  english: 'AI Developer',
  Question1: {
    main: '본인이 생각하기에 좋은 개발자란 무엇인가요?',
  },
  Question2: {
    main: '지원하게 된 동기가 무엇인가요?',
    sub: '본인의 경험을 기반으로 어필할 수 있는 내용에 대해 자유롭게 기재해주세요.',
  },
  Question3: {
    main: '본인이 겪었던 힘들었던 문제 상황을 적어주세요',
    sub: '프로젝트 말고도 본인이 겪었던 문제 상황과 어떻게 해결한 방법에 대해 적어주세요.',
  },
  Question4: {
    main: '본인이 협업해본 경험에 대해 적어주세요.',
    sub: '협업에서 본인이 어떤 부분을 맡았는지, 느낀점과 깨달은 점을 적어주세요. (없으면 안 적어주셔도 상관없습니다.)',
  },
};

export const AndroidData = {
  korean: '안드로이드 개발자',
  english: 'Android Developer',
  Question1: {
    main: '본인이 생각하기에 좋은 개발자란 무엇인가요?',
  },
  Question2: {
    main: '지원하게 된 동기가 무엇인가요?',
    sub: '본인의 경험을 기반으로 어필할 수 있는 내용에 대해 자유롭게 기재해주세요.',
  },
  Question3: {
    main: '본인이 겪었던 힘들었던 문제 상황을 적어주세요',
    sub: '프로젝트 말고도 본인이 겪었던 문제 상황과 어떻게 해결한 방법에 대해 적어주세요.',
  },
  Question4: {
    main: '본인이 협업해본 경험에 대해 적어주세요.',
    sub: '협업에서 본인이 어떤 부분을 맡았는지, 느낀점과 깨달은 점을 적어주세요. (없으면 안 적어주셔도 상관없습니다.)',
  },
};

export const DesignerData = {
  korean: '디자이너',
  english: 'Designer',
  Question1: {
    main: '본인이 생각하기에 좋은 디자이너란 무엇인가요?',
  },
  Question2: {
    main: '지원하게 된 동기가 무엇인가요?',
    sub: '본인의 경험을 기반으로 어필할 수 있는 내용에 대해 자유롭게 기재해주세요.',
  },
  Question3: {
    main: '본인이 겪었던 힘들었던 문제 상황을 적어주세요',
    sub: '프로젝트 말고도 본인이 겪었던 문제 상황과 어떻게 해결한 방법에 대해 적어주세요.',
  },
  Question4: {
    main: 'GDSC KNU에서 디자이너로서 어떤 것을 얻어가고 싶으신가요?',
    sub: '디자이너로 활동하면서 얻고 싶은 것이나 이루고 싶은 목표에 대해 적어주세요.',
  },
};
